In [0]:
#The goal if this notebook is to provide beginners with a 
quick tour of the typical pandas (Python library) operations. 
These operations are commonly performed during data-preprocessing 
steps for any Machine Learning / Deep learning based model. 
I am sure you will be able to quickly and easily grasp the concepts demonstrated 
in this notebook.

In [2]:
#1. How to install pandas packge using command
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.0.3)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.18.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [0]:
#import pandas package as pd
import pandas as pd
import numpy as np

In [4]:
#Print Pandas version using print
print(pd.__version__)

1.0.3

In [0]:
#how to get documentaion of pandas

In [0]:
#create an empty data frame
df=pd.DataFrame([['a1','b1'],['a2','b2'],['a3','b3'],['a3','b4']],columns=['a','b'])

In [6]:
df.head()

    a   b
0  a1  b1
1  a2  b2
2  a3  b3
3  a3  b4

In [7]:
#title Default title text
# convert 2 dimention list to data frame
#let a be a 2-d list which are having 4 columns and 2 row
a=[[1,2,3,4],[4,5,6,7]]
df1=pd.DataFrame(a,columns=['col1','col2','col3','col4'])
df1.head(4)

   col1  col2  col3  col4
0     1     2     3     4
1     4     5     6     7

In [8]:
#Selecting/Querying
#column selection
df['a']

0    a1
1    a2
2    a3
3    a3
Name: a, dtype: object

In [9]:
#print the column list of data frame columns
df.columns

Index(['a', 'b'], dtype='object')

In [10]:
#print data type of each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      object
 1   b       4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [11]:
#single column selection
df[['a']]

    a
0  a1
1  a2
2  a3
3  a3

In [12]:
#multiple columns selection
df[['a','b']]

    a   b
0  a1  b1
1  a2  b2
2  a3  b3
3  a3  b4

In [13]:
#select a row with index 
df[df.index==0]

    a   b
0  a1  b1

In [14]:
#select a row with index and column
df[df.index==0][['a']]

    a
0  a1

In [15]:
#You can also select by absolute coordinates/position in the frame. Indices are zero based:
#select first row
df.iloc[1]

a    a2
b    b2
Name: 1, dtype: object

In [16]:
# Selects rows 1-to-2
df.iloc[0:2]

    a   b
0  a1  b1
1  a2  b2

In [17]:
#select 0th row and 0th column
df.iloc[0,0]

'a1'

In [18]:
# select some continuous rows and columns
# df.iloc[start_row_index:End_row_index,start_column_index:End_column_index]
df.iloc[0:2,0:2]

    a   b
0  a1  b1
1  a2  b2

In [19]:
# select data by applying condition on a single column
#df[df.column_name condtional_op operand]
df[df.a=='a2']

    a   b
1  a2  b2

In [20]:
# select data by applying condition on multiple columns
#df[(df.column_name1 condtional_op operand) eithor and or(df.column_name2 condtional_op operand)]
df[(df.a=='a2')|(df.b=='b1')]

    a   b
0  a1  b1
1  a2  b2

In [21]:
#same as above only operator chages
df[(df.a=='a2')&(df.b=='b1')]

Empty DataFrame
Columns: [a, b]
Index: []

In [22]:
#Create an empty column in existing data frame
#df['New_column_name']=np.nan
print('before inserting a column c')
print(df.columns)
df['c']=np.nan
print('after inserting a column c')
print(df.columns)

before inserting a column c
Index(['a', 'b'], dtype='object')
after inserting a column c
Index(['a', 'b', 'c'], dtype='object')

In [0]:
# modify dataframe

In [23]:
# Modifying the dataframe identified by its row index and column
#df.at[row_index,columns]=replace value
print('befor change')
print(df)
df.at[1,'b']='r1'
print('after change')
print(df)

befor change
    a   b   c
0  a1  b1 NaN
1  a2  b2 NaN
2  a3  b3 NaN
3  a3  b4 NaN
after change
    a   b   c
0  a1  b1 NaN
1  a2  r1 NaN
2  a3  b3 NaN
3  a3  b4 NaN

In [24]:
# Modifying the dataframe identified by its row index and column index
#df.at[row_index,columns]=replace value
print('befor change')
print(df)
df.iat[1,2]=10
print('after change')
print(df)

befor change
    a   b   c
0  a1  b1 NaN
1  a2  r1 NaN
2  a3  b3 NaN
3  a3  b4 NaN
after change
    a   b     c
0  a1  b1   NaN
1  a2  r1  10.0
2  a3  b3   NaN
3  a3  b4   NaN

In [0]:
#insert a new column in existing data frame and column datatype is integer
df['d']=2

In [26]:
#convert the data type of particular column
#df.at[row_index,columns]=replace value
print('before conversion')
print(df.info())
df['d']=df['c'].astype('float')
print('after conversion')
print(df.info())

before conversion
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      object
 1   b       4 non-null      object
 2   c       1 non-null      float64
 3   d       4 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 256.0+ bytes
None
after conversion
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      object
 1   b       4 non-null      object
 2   c       1 non-null      float64
 3   d       1 non-null      float64
dtypes: float64(2), object(2)
memory usage: 256.0+ bytes
None

In [0]:
#insert two columns in existing data frame
df['e']=[4,5,3,26]
df['f']=[40,25,30,26]

In [28]:
# sort the data frame by particular column
print('before sorting')
print(df)
df=df.sort_values(by=['e', 'f'], ascending=False)
print('after sorting')
print(df)

before sorting
    a   b     c     d   e   f
0  a1  b1   NaN   NaN   4  40
1  a2  r1  10.0  10.0   5  25
2  a3  b3   NaN   NaN   3  30
3  a3  b4   NaN   NaN  26  26
after sorting
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  26
1  a2  r1  10.0  10.0   5  25
0  a1  b1   NaN   NaN   4  40
2  a3  b3   NaN   NaN   3  30

In [29]:
# Sort rows in descending order by the index
print('before sorting')
print(df)
df=df.sort_index(axis=0, ascending=False)
print('after sorting')
print(df)
#df.sort_index(axis=0, ascending=False)

before sorting
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  26
1  a2  r1  10.0  10.0   5  25
0  a1  b1   NaN   NaN   4  40
2  a3  b3   NaN   NaN   3  30
after sorting
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  26
2  a3  b3   NaN   NaN   3  30
1  a2  r1  10.0  10.0   5  25
0  a1  b1   NaN   NaN   4  40

In [30]:
# add constant value to a particular column
print('before adding')
print(df)
df['f']=df['f']+10
print('after adding')
print(df)

before adding
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  26
2  a3  b3   NaN   NaN   3  30
1  a2  r1  10.0  10.0   5  25
0  a1  b1   NaN   NaN   4  40
after adding
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  36
2  a3  b3   NaN   NaN   3  40
1  a2  r1  10.0  10.0   5  35
0  a1  b1   NaN   NaN   4  50

In [31]:
# add constant value to a particular columns and add 
#it to a new columns by using a function

def add_constant(x):
  return x+20
print('before adding')
print(df)
df['f_new']=add_constant(df['f'])
print('after adding')
print(df)

before adding
    a   b     c     d   e   f
3  a3  b4   NaN   NaN  26  36
2  a3  b3   NaN   NaN   3  40
1  a2  r1  10.0  10.0   5  35
0  a1  b1   NaN   NaN   4  50
after adding
    a   b     c     d   e   f  f_new
3  a3  b4   NaN   NaN  26  36     56
2  a3  b3   NaN   NaN   3  40     60
1  a2  r1  10.0  10.0   5  35     55
0  a1  b1   NaN   NaN   4  50     70

In [32]:
#Changing the shape of dataframe using pivot
df.pivot(index='a',columns='b',values='c')

b   b1  b3  b4    r1
a
a1 NaN NaN NaN   NaN
a2 NaN NaN NaN  10.0
a3 NaN NaN NaN   NaN

In [0]:
#Reading data in pandas datafrme
df2=pd.read_csv('GOOG.csv')

In [34]:
# showing the top five row of data
df2.head(5)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
1  2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2  2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
3  2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
4  2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [35]:
# describe your data
df2.describe([.9,.91,.92,.93,.94,.95])

              Open         High  ...    Adj Close        Volume
count  3939.000000  3939.000000  ...  3939.000000  3.939000e+03
mean    504.683970   509.337943  ...   504.722125  7.004023e+06
std     354.087405   357.165023  ...   354.412927  8.033192e+06
min      49.409801    50.680038  ...    49.818268  7.900000e+03
50%     328.344299   332.827484  ...   328.294464  4.302900e+06
90%    1106.535987  1120.463989  ...  1106.294019  1.606508e+07
91%    1122.735998  1132.846423  ...  1121.332209  1.693041e+07
92%    1141.235190  1151.127212  ...  1140.981191  1.774946e+07
93%    1159.381402  1174.230781  ...  1162.813421  1.888893e+07
94%    1177.245976  1187.371655  ...  1175.817578  2.032450e+07
95%    1195.256995  1203.942004  ...  1195.367054  2.163055e+07
max    1525.069946  1532.105957  ...  1526.689941  8.254150e+07

[12 rows x 6 columns]

In [36]:
#Dates and Time
df2.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
1  2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2  2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
3  2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
4  2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [0]:
df2['Date'] = pd.to_datetime(df2['Date'])

In [38]:
df2.head()

        Date       Open       High        Low      Close  Adj Close    Volume
0 2004-08-19  49.813286  51.835709  47.800831  49.982655  49.982655  44871300
1 2004-08-20  50.316402  54.336334  50.062355  53.952770  53.952770  22942800
2 2004-08-23  55.168217  56.528118  54.321388  54.495735  54.495735  18342800
3 2004-08-24  55.412300  55.591629  51.591621  52.239193  52.239193  15319700
4 2004-08-25  52.284027  53.798351  51.746044  52.802086  52.802086   9232100

In [39]:
#Extract year from date
df2['year'] = pd.DatetimeIndex(df2['Date']).year
df2.head()

        Date       Open       High  ...  Adj Close    Volume  year
0 2004-08-19  49.813286  51.835709  ...  49.982655  44871300  2004
1 2004-08-20  50.316402  54.336334  ...  53.952770  22942800  2004
2 2004-08-23  55.168217  56.528118  ...  54.495735  18342800  2004
3 2004-08-24  55.412300  55.591629  ...  52.239193  15319700  2004
4 2004-08-25  52.284027  53.798351  ...  52.802086   9232100  2004

[5 rows x 8 columns]

In [40]:
#Extract month from date
df2['month'] = pd.DatetimeIndex(df2['Date']).month
df2.head()

        Date       Open       High        Low  ...  Adj Close    Volume  year  month
0 2004-08-19  49.813286  51.835709  47.800831  ...  49.982655  44871300  2004      8
1 2004-08-20  50.316402  54.336334  50.062355  ...  53.952770  22942800  2004      8
2 2004-08-23  55.168217  56.528118  54.321388  ...  54.495735  18342800  2004      8
3 2004-08-24  55.412300  55.591629  51.591621  ...  52.239193  15319700  2004      8
4 2004-08-25  52.284027  53.798351  51.746044  ...  52.802086   9232100  2004      8

[5 rows x 9 columns]

In [41]:
#Extract week from date
df2['week'] = pd.DatetimeIndex(df2['Date']).week
df2.head()

        Date       Open       High        Low  ...    Volume  year  month  week
0 2004-08-19  49.813286  51.835709  47.800831  ...  44871300  2004      8    34
1 2004-08-20  50.316402  54.336334  50.062355  ...  22942800  2004      8    34
2 2004-08-23  55.168217  56.528118  54.321388  ...  18342800  2004      8    35
3 2004-08-24  55.412300  55.591629  51.591621  ...  15319700  2004      8    35
4 2004-08-25  52.284027  53.798351  51.746044  ...   9232100  2004      8    35

[5 rows x 10 columns]

In [42]:
#Extract Month year from date
df2['month_year'] = pd.to_datetime(df2['Date']).dt.to_period('M')
df2.head()

        Date       Open       High        Low  ...  year  month  week  month_year
0 2004-08-19  49.813286  51.835709  47.800831  ...  2004      8    34     2004-08
1 2004-08-20  50.316402  54.336334  50.062355  ...  2004      8    34     2004-08
2 2004-08-23  55.168217  56.528118  54.321388  ...  2004      8    35     2004-08
3 2004-08-24  55.412300  55.591629  51.591621  ...  2004      8    35     2004-08
4 2004-08-25  52.284027  53.798351  51.746044  ...  2004      8    35     2004-08

[5 rows x 11 columns]

In [0]:
#Count the null value in each data frame

In [44]:
df.isna().sum()

a        0
b        0
c        3
d        3
e        0
f        0
f_new    0
dtype: int64

In [45]:
#This is same as above
len(df)-df.count()

a        0
b        0
c        3
d        3
e        0
f        0
f_new    0
dtype: int64

In [46]:
#drop a complete row if all values of that row are null
df=df.dropna(how='all')
print(df)

    a   b     c     d   e   f  f_new
3  a3  b4   NaN   NaN  26  36     56
2  a3  b3   NaN   NaN   3  40     60
1  a2  r1  10.0  10.0   5  35     55
0  a1  b1   NaN   NaN   4  50     70

In [47]:
#drop a complete row if any value of that row are null
df=df.dropna(how='any')
print(df)

    a   b     c     d  e   f  f_new
1  a2  r1  10.0  10.0  5  35     55

In [0]:
#concatenate two data frame horizontally and vertically

In [49]:
df1 = pd.DataFrame({
    'A': ['a','b','c','d'],
    'B': range(4)
})
print (df1)
  
df2 = pd.DataFrame({
    'C': ['c1','c2','c3','c4'],
    'D': range(4,8)
})
print(df2)

   A  B
0  a  0
1  b  1
2  c  2
3  d  3
    C  D
0  c1  4
1  c2  5
2  c3  6
3  c4  7

In [50]:
df3=pd.concat([df1, df2], axis= 1)
print(df3)

   A  B   C  D
0  a  0  c1  4
1  b  1  c2  5
2  c  2  c3  6
3  d  3  c4  7

In [51]:
df3=pd.concat([df1, df2], axis= 0)
print(df3)

     A    B    C    D
0    a  0.0  NaN  NaN
1    b  1.0  NaN  NaN
2    c  2.0  NaN  NaN
3    d  3.0  NaN  NaN
0  NaN  NaN   c1  4.0
1  NaN  NaN   c2  5.0
2  NaN  NaN   c3  6.0
3  NaN  NaN   c4  7.0

In [52]:
print('df1:')
df1 = pd.DataFrame({
    'A': ['a','b','c','d'],
    'B': range(4)
})
print (df1)
  
print('df2:')
df2 = pd.DataFrame({
    'A': ['c1','c2','c3','c4'],
    'B': range(4,8)
})
print(df2)

df1:
   A  B
0  a  0
1  b  1
2  c  2
3  d  3
df2:
    A  B
0  c1  4
1  c2  5
2  c3  6
3  c4  7

In [53]:
df3=pd.concat([df1, df2], axis= 0)
print(df3)

    A  B
0   a  0
1   b  1
2   c  2
3   d  3
0  c1  4
1  c2  5
2  c3  6
3  c4  7

In [54]:
df3=df3.reset_index(drop=True)
print(df3)

    A  B
0   a  0
1   b  1
2   c  2
3   d  3
4  c1  4
5  c2  5
6  c3  6
7  c4  7

In [55]:
df1 = pd.DataFrame({'X': ['x1', 'x2', 'x3', 'x4'],
                        'Y': ['y1', 'y2', 'y3', 'y4'],
                       'Z': ['z1', 'z2', 'z3', 'z3'],
                      'T': ['t1', 't2', 't3', 't4']}
                    )
print(df1)

    X   Y   Z   T
0  x1  y1  z1  t1
1  x2  y2  z2  t2
2  x3  y3  z3  t3
3  x4  y4  z3  t4

In [56]:
 df2 = pd.DataFrame({'X': [ 'x5', 'x6', 'x7','x8'],
                    'Y': [ 'x5', 'x6', 'x7','x8'],
                    'Z': ['z5', 'z6', 'z7','z8'],
                    'T': ['t5', 't6', 't7','t8']}
                   )
 print(df2)

    X   Y   Z   T
0  x5  x5  z5  t5
1  x6  x6  z6  t6
2  x7  x7  z7  t7
3  x8  x8  z8  t8

In [57]:
df3 = pd.DataFrame({'X': ['x9', 'x10', 'x11','x12'],
                    'Y': ['y9', 'y10', 'y11', 'y12'],
                    'Z': [ 'z9', 'z10', 'z11','z12'],
                     'T': [ 't9', 't10', 't11','t12']}
                  )

print(df3)

     X    Y    Z    T
0   x9   y9   z9   t9
1  x10  y10  z10  t10
2  x11  y11  z11  t11
3  x12  y12  z12  t12

In [58]:
result = pd.concat([df1, df2], axis=1, sort=False)
print(result)

    X   Y   Z   T   X   Y   Z   T
0  x1  y1  z1  t1  x5  x5  z5  t5
1  x2  y2  z2  t2  x6  x6  z6  t6
2  x3  y3  z3  t3  x7  x7  z7  t7
3  x4  y4  z3  t4  x8  x8  z8  t8

In [59]:
result = pd.concat([df1, df2], axis=0, sort=False).reset_index(drop=True)
print(result)

    X   Y   Z   T
0  x1  y1  z1  t1
1  x2  y2  z2  t2
2  x3  y3  z3  t3
3  x4  y4  z3  t4
4  x5  x5  z5  t5
5  x6  x6  z6  t6
6  x7  x7  z7  t7
7  x8  x8  z8  t8

In [60]:
#left join on a particular key
result = pd.merge(df1, df2,on='X', how='left').reset_index(drop=True)
print(result)

    X Y_x Z_x T_x  Y_y  Z_y  T_y
0  x1  y1  z1  t1  NaN  NaN  NaN
1  x2  y2  z2  t2  NaN  NaN  NaN
2  x3  y3  z3  t3  NaN  NaN  NaN
3  x4  y4  z3  t4  NaN  NaN  NaN

In [61]:
#left join on more than one keys
result = pd.merge(df1, df2,on=['X','Y'], how='left').reset_index(drop=True)
print(result)

    X   Y Z_x T_x  Z_y  T_y
0  x1  y1  z1  t1  NaN  NaN
1  x2  y2  z2  t2  NaN  NaN
2  x3  y3  z3  t3  NaN  NaN
3  x4  y4  z3  t4  NaN  NaN

In [62]:
# right join on a particular key
result = pd.merge(df1, df2,on='X', how='right').reset_index(drop=True)
print(result)

    X  Y_x  Z_x  T_x Y_y Z_y T_y
0  x5  NaN  NaN  NaN  x5  z5  t5
1  x6  NaN  NaN  NaN  x6  z6  t6
2  x7  NaN  NaN  NaN  x7  z7  t7
3  x8  NaN  NaN  NaN  x8  z8  t8

In [63]:
# right join on more than one key
result = pd.merge(df1, df2,on=['X','Y'], how='right').reset_index(drop=True)
print(result)

    X   Y  Z_x  T_x Z_y T_y
0  x5  x5  NaN  NaN  z5  t5
1  x6  x6  NaN  NaN  z6  t6
2  x7  x7  NaN  NaN  z7  t7
3  x8  x8  NaN  NaN  z8  t8

In [64]:
# Outer join on a perticular key
result = pd.merge(df1, df2,on='X', how='outer').reset_index(drop=True)
print(result)

    X  Y_x  Z_x  T_x  Y_y  Z_y  T_y
0  x1   y1   z1   t1  NaN  NaN  NaN
1  x2   y2   z2   t2  NaN  NaN  NaN
2  x3   y3   z3   t3  NaN  NaN  NaN
3  x4   y4   z3   t4  NaN  NaN  NaN
4  x5  NaN  NaN  NaN   x5   z5   t5
5  x6  NaN  NaN  NaN   x6   z6   t6
6  x7  NaN  NaN  NaN   x7   z7   t7
7  x8  NaN  NaN  NaN   x8   z8   t8

In [65]:
# Outer join more then one key
result = pd.merge(df1, df2,on=['X','Y'], how='outer').reset_index(drop=True)
print(result)

    X   Y  Z_x  T_x  Z_y  T_y
0  x1  y1   z1   t1  NaN  NaN
1  x2  y2   z2   t2  NaN  NaN
2  x3  y3   z3   t3  NaN  NaN
3  x4  y4   z3   t4  NaN  NaN
4  x5  x5  NaN  NaN   z5   t5
5  x6  x6  NaN  NaN   z6   t6
6  x7  x7  NaN  NaN   z7   t7
7  x8  x8  NaN  NaN   z8   t8